//Составить программу сравнения двух чисел 1 и 2.
// Если 1 меньше 2 – вывести на экран слово «yes», в противном случае – слово «no»
package com.epam;

public class Task02c {
    public static void main(String[] args) {
        int a = 4;
        int b = 3;
        if (a<b)
            System.out.println("yes");
        else
            System.out.println("no");
    }
}
